# OpeningElementId Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCOpeningData..::..OpeningElementId Property
IFCOpeningData Class See Also
---
The opening element id.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public ElementId OpeningElementId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property OpeningElementId As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ OpeningElementId {
	ElementId^ get ();
}
```

# See Also
IFCOpeningData Class
Autodesk.Revit.DB.IFC Namespace